       01  COLMN-RECORD.
           05  MB-CLIENT-NO   PIC X(4).
           05  MB-LOAN-NO     PIC X(10).
           05  MB-REC-CODE    PIC X(2).
           05  COLUMN-ARRAY   OCCURS 13 TIMES.
               10  VALUE      PIC X(15).

