       01  LPSNCFPB-RECORD.
           05 CLIENT-NO                     PIC X(3).
           05 CLIENT-SUFFIX                 PIC X.
           05 LOAN-NO                       PIC X(7).
           05 REC-CODE                      PIC X.
           05 REC-NUMBER                    PIC 9(3).
           05 NON-BORR-RECORD-NUMBER        PIC XX.
           05 NON-BORR-NAME                 PIC X(40).
           05 NON-BORR-EXTRA-ADDRESS-LINE-1 PIC X(40).
           05 NON-BORR-EXTRA-ADDRESS-LINE-2 PIC X(40).
           05 NON-BORR-EXTRA-ADDRESS-LINE-3 PIC X(40).
           05 NON-BORR-STREET               PIC X(40).
           05 NON-BORR-CITY                 PIC X(26).
           05 NON-BORR-STATE                PIC X(2).
           05 NON-BORR-ZIP                  PIC X(5).
           05 NON-BORR-ZIP-SUFFIX           PIC X(4).
           05 NON-BORR-FOREIGN-ADDRESS-CODE PIC X.
           05 NON-BORR-COUNTRY-CODE         PIC XX.
           05 NON-BORR-PROVENCE-CODE        PIC XX.
           05 NON-BORR-TYPE                 PIC XX.
           05 NON-BORR-NOTICE-TYPE-B        PIC X.
           05 NON-BORR-PRIMARY-EMAIL        PIC X(66).
           05 E-CONSENT-CODE                PIC X.
           05 NON-BORR-ATTORNEY-NAME-1      PIC X(30).
           05 NON-BORR-ATTORNEY-NAME-2      PIC X(30).
           05 NON-BORR-ATTORNEY-ADD-1       PIC X(30).
           05 NON-BORR-ATTORNEY-ADD-2       PIC X(30).
           05 NON-BORR-ATTORNEY-ADD-3       PIC X(30).
           05 NON-BORR-ATTORNEY-CITY        PIC X(30).
           05 NON-BORR-ATTORNEY-STATE       PIC X(2).
           05 NON-BORR-ATTORNEY-ZIP         PIC X(5).
           05 NON-BORR-ATTORNEY-ZIP-4       PIC X(4).
           05 ATTORNEY-NOTICE-TYPE-B        PIC X.
           05 BORR-NUMBER                   PIC X(2).
           05 CO-BORR-ADDR-MATCH-IND        PIC X.
           05 ADDL-CO-BORR-NAME             PIC X(30).
           05 CO-BORR2-NAME                 PIC X(30).
           05 CO-BORR2-ADDRESS-LINE-1       PIC X(30).
           05 CO-BORR2-ADDRESS-LINE-2       PIC X(30).
           05 CO-BORR2-STREET               PIC X(30).
           05 CO-BORR2-CITY                 PIC X(21).
           05 CO-BORR2-STATE                PIC X(2).
           05 CO-BORR2-ZIP                  PIC X(5).
           05 CO-BORR2-ZIP-SUFFIX           PIC X(4).
           05 FOREIGN-ADDR-IND-CO-BORR      PIC X.
           05 CO-MTGR-ADDR-MATCH-IND        PIC X.
           05 CO-MTGR-NAME                  PIC X(30).
           05 CO-MTGR-ADDRESS-LINE1         PIC X(30).
           05 CO-MTGR-ADDRESS-LINE2         PIC X(30).
           05 CO-MTGR-STREET                PIC X(30).
           05 CO-MTGR-CITY                  PIC X(21).
           05 CO-MTGR-STATE                 PIC X(2).
           05 CO-MTGR-ZIP                   PIC X(5).
           05 CO-MTGR-ZIP-SUFFIX            PIC X(4).
           05 FOREIGN-ADDR-IND-CO-MTGR      PIC X.
           05 TP-NAME                       PIC X(30).
           05 TP-ADDRESS-LINE-1             PIC X(30).
           05 TP-ADDRESS-LINE-2             PIC X(30).
           05 TP-STREET                     PIC X(30).
           05 TP-CITY                       PIC X(21).
           05 TP-STATE                      PIC X(2).
           05 TP-ZIP                        PIC X(5).
           05 TP-ZIP-SUFFIX                 PIC X(4).
           05 FOREIGN-ADDR-IND-TP           PIC X.

