       01  LPSVCFPB-RECORD.
           05 CLIENT-NO PIC X(3).
           05 CLIENT-SUFFIX PIC X.
           05 LOAN-NO PIC X(7).
           05 REC-CODE PIC X.
           05 REC-NUMBER PIC 9(3).
           05 FILLER PIC X(10).
           05 1ST-PRIN-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 2ND-PRIN-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 1ST-INT-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 2ND-INT-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 MISC-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 REP-RES-SUB-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 HUD-PART-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 REC-CORP-ADV-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 1ST-PRIN-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 2ND-PRIN-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 1ST-INT-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 2ND-INT-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 ESC-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 LIFE-INS-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 AH-INS-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 MISC-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 FEES-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 REP-RES-SUB-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 HUD-PART-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 REC-CORP-ADV-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 TOTAL-PD-YTD-AMT PIC S9(11)V99 COMP-3.
           05 TOTAL-PD-BTD-AMT PIC S9(11)V99 COMP-3.
           05 FEES-BTD-AMT PIC S9(9)V99 COMP-3.
           05 REC-CORP-ADV-BTD-AMT PIC S9(9)V99 COMP-3.
           05 SUSPENSE-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 FILLER PIC X(2042).
           05 PSH-1ST-PRIN-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-2ND-PRIN-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-1ST-INT-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-2ND-INT-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-ESC-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-LIFE-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-AH-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-MISC-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-L-C-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-REP-RES-SUB-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-HUD-PART-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-REC-CORP-ADV-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-SUSP-PD-BTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-TOTAL-PD-BTD-AMT PIC S9(11)V99 COMP-3.
           05 PSH-1ST-PRIN-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-2ND-PRIN-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-1ST-INT-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-2ND-INT-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-ESC-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-LIFE-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-AH-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-MISC-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-FEES-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-REP-RES-SUB-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-HUD-PART-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-REC-CORP-ADV-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-SUSP-PD-YTD-AMT PIC S9(9)V99 COMP-3.
           05 PSH-TOTAL-PD-YTD-AMT PIC S9(11)V99 COMP-3.
           05 FILLER PIC X(1611).

