       01  WS-P2-REC.
           05  WS-P2-TYPE                  PIC X.
           05  WS-P2-ACCOUNT               PIC S9(13) COMP-3.
           05  WS-IRS-PB-BEG-RPT-SW        PIC X.
           05  WS-IRS-PROP-ADDR-OR-DESC-SW PIC X.
           05  WS-IRS-PROP-ADDR-OR-DESC    PIC X(39).
           05  WS-IRS-PROP-ADDR-OR-DESC2   PIC X(39).
           05  WS-CITY                     PIC S9(4) COMP-3.
           05  FILLER                      PIC X(7).

