       01  CNP750-PROP-REC.
           05  P-TYPE                       PIC X.
           05  P-ACCOUNT                    PIC S9(13) COMP-3.
           05  P-PROP-ADDR                  PIC X(33).
           05  P-CITY                       PIC X(21).
           05  P-STATE                      PIC XX.
           05  FILLER                       PIC X(10).
           05  P-ZIP5                       PIC X(5).
           05  P-ZIP4                       PIC X(4).
           05  FILLER                       PIC X(667).

